import {DictionaryType} from "@/locales";

const ru: DictionaryType = {
    chooseLanguage: "Выберите язык",
    locale: "Русский",
    errors: {
        something: "Что-то пошло не так! 😵",
        hacker: "Будущий хакер 😏",
    },
    back: "Назад ⬅️",
    navbar: {
        items: {
            about: "О себе",
            projects: "Проекты",
            testimonials: "Отзывы",
            contact: "Контакты",
        },
        downloadCv: "Скачать резюме",
    },
    hero: {
        title: "Привет, я Умид",
        noBio: "Это место для моей биографии, но она не загрузилась из-за твоего плохого интернета.",
        noCity: "Город не загружен",
        noStatus: "Статус также :(",
    },
}

export default ru;